Tekla Open API Reference for Tekla Structures 2025
ConnectiveGeometry.IsEmpty Method
 Checks whether the geometry is degenerate
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsEmpty()
Public Function IsEmpty As Boolean
Return Value
Type: Boolean
True, if the geometry does not contain any section.
See Also
Reference
ConnectiveGeometry Class
Tekla.Structures.Model Namespace